templator_front.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-06-04 Fri 12:15 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Front end API</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="TREX-CoE" />
<link rel="stylesheet" title="Standard" href="trexio.css" type="text/css" />


</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Front end API</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org84645b7">1. Coding conventions</a>
<ul>
<li><a href="#orga682226">1.1. Memory allocation</a></li>
</ul>
</li>
<li><a href="#org25b4c1d">2. Front end</a>
<ul>
<li><a href="#org0cf9a25">2.1. Error handling</a></li>
<li><a href="#org441bc37">2.2. Back ends</a></li>
<li><a href="#org92825c2">2.3. Read/write behavior</a></li>
<li><a href="#org6bc2172">2.4. TREXIO file type</a></li>
<li><a href="#org28aaa0a">2.5. Polymorphism of the file handle</a></li>
<li><a href="#orgb12e187">2.6. File opening</a></li>
<li><a href="#org0fce83e">2.7. File closing</a></li>
<li><a href="#org4bc7201">2.8. C helper functions</a></li>
</ul>
</li>
<li><a href="#orgce5d3dc">3. Templates for front end</a>
<ul>
<li><a href="#orgb2af4b7">3.1. Templates for front end has/read/write a dimension</a>
<ul>
<li><a href="#org95e34d4">3.1.1. C templates for front end</a></li>
<li><a href="#org1d3c2a2">3.1.2. Fortran templates for front end</a></li>
</ul>
</li>
<li><a href="#orgda84b33">3.2. Templates for front end has/read/write a dataset</a>
<ul>
<li><a href="#org54ac865">3.2.1. C templates for front end</a></li>
<li><a href="#org4698ede">3.2.2. Fortran templates for front end</a></li>
</ul>
</li>
<li><a href="#org1753b9e">3.3. Sparse data structures</a></li>
</ul>
</li>
<li><a href="#org060103a">4. Fortran helper/wrapper functions</a></li>
</ul>
</div>
</div>

<div id="outline-container-org84645b7" class="outline-2">
<h2 id="org84645b7"><span class="section-number-2">1</span> Coding conventions</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>integer types will be defined using types given in <code>stdint.h</code></li>
<li>pointers are always initialized to <code>NULL</code></li>
<li>when memory is freed, the pointer is set to <code>NULL</code></li>
<li><code>assert.h</code> should be used extensively</li>
<li>variable names are in lower case</li>
<li><code>#define</code> constants are in upper case</li>
<li>structs are suffixed by <code>_s</code></li>
<li>types are suffixed by <code>_t</code></li>
<li>API calls return <code>trexio_exit_code</code> (except for <code>trexio_open</code> function)</li>
</ul>
</div>

<div id="outline-container-orga682226" class="outline-3">
<h3 id="orga682226"><span class="section-number-3">1.1</span> Memory allocation</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Memory allocation of structures can be facilitated by using the
following macro, which ensures that the size of the allocated
object is the same as the size of the data type pointed by the pointer.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #483d8b;">#define</span> <span style="color: #0000ff;">MALLOC</span>(<span style="color: #a0522d;">T</span>) (<span style="color: #228b22;">T</span>*) malloc (<span style="color: #a020f0;">sizeof</span>(T))
<span style="color: #483d8b;">#define</span> <span style="color: #0000ff;">CALLOC</span>(<span style="color: #a0522d;">N</span>,<span style="color: #a0522d;">T</span>) (<span style="color: #228b22;">T</span>*) calloc ( (N) , <span style="color: #a020f0;">sizeof</span>(T) )
</pre>
</div>

<p>
When a pointer is freed, it should be set to <code>NULL</code>.
This can be facilitated by the use of the following macro:
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #483d8b;">#define</span> <span style="color: #0000ff;">FREE</span>(<span style="color: #a0522d;">X</span>) { free(X) ; (X)=<span style="color: #008b8b;">NULL</span>; }
</pre>
</div>

<p>
The maximum string size for the filenames is 4096 characters.
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #483d8b;">#define</span> <span style="color: #a0522d;">TREXIO_MAX_FILENAME_LENGTH</span> 4096
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org25b4c1d" class="outline-2">
<h2 id="org25b4c1d"><span class="section-number-2">2</span> Front end</h2>
<div class="outline-text-2" id="text-2">
<p>
All calls to TREXIO are thread-safe.
TREXIO front end is modular, which simplifies implementation of new back ends.
</p>
</div>
