src/templates_front/templator_front.org
** Error handling

      #+NAME: table-exit-codes
   | Macro                        | Code | Description                            |
   |------------------------------+------+----------------------------------------|
   | ~TREXIO_FAILURE~             |   -1 | 'Unknown failure'                      |
   | ~TREXIO_SUCCESS~             |    0 | 'Success'                              |
   | ~TREXIO_INVALID_ARG_1~       |    1 | 'Invalid argument 1'                   |
   | ~TREXIO_INVALID_ARG_2~       |    2 | 'Invalid argument 2'                   |
   | ~TREXIO_INVALID_ARG_3~       |    3 | 'Invalid argument 3'                   |
   | ~TREXIO_INVALID_ARG_4~       |    4 | 'Invalid argument 4'                   |
   | ~TREXIO_INVALID_ARG_5~       |    5 | 'Invalid argument 5'                   |
   | ~TREXIO_END~                 |    6 | 'End of file'                          |
   | ~TREXIO_READONLY~            |    7 | 'Read-only file'                       |
   | ~TREXIO_ERRNO~               |    8 | strerror(errno)                        |
   | ~TREXIO_INVALID_ID~          |    9 | 'Invalid ID'                           |
   | ~TREXIO_ALLOCATION_FAILED~   |   10 | 'Allocation failed'                    |
   | ~TREXIO_HAS_NOT~             |   11 | 'Element absent'                       |
   | ~TREXIO_INVALID_NUM~         |   12 | 'Invalid dimensions'                   |
   | ~TREXIO_NUM_ALREADY_EXISTS~  |   13 | 'Dimensioning variable already exists' |
   | ~TREXIO_DSET_ALREADY_EXISTS~ |   14 | 'Dataset already exists'               |
   | ~TREXIO_OPEN_ERROR~          |   15 | 'Error opening file'                   |
   | ~TREXIO_LOCK_ERROR~          |   16 | 'Error locking file'                   |
   | ~TREXIO_UNLOCK_ERROR~        |   17 | 'Error unlocking file'                 |
   | ~TREXIO_FILE_ERROR~          |   18 | 'Invalid file handle'                  |
   | ~TREXIO_GROUP_READ_ERROR~    |   19 | 'Error reading group'                  |
   | ~TREXIO_GROUP_WRITE_ERROR~   |   20 | 'Error writing group'                  |
   | ~TREXIO_ELEM_READ_ERROR~     |   21 | 'Error reading element'                |
   | ~TREXIO_ELEM_WRITE_ERROR~    |   22 | 'Error writing element'                |

   # We need to force Emacs not to indent the Python code:
   # -*- org-src-preserve-indentation: t

   #+begin_src python :var table=table-exit-codes :results drawer :exports none
""" This script generates the C and Fortran constants for the error
    codes from the org-mode table.
"""

result = [ "#+begin_src c :tangle prefix_front.h :exports none" ]
for (text, code,_) in table:
  text=text.replace("~","")
  result += [ f"#define  {text:30s} ((trexio_exit_code) {code:d})" ]
result += [ "#+end_src" ]

result += [ "" ]

result += [ "#+begin_src f90 :tangle prefix_fortran.f90 :exports none" ]
for (text, code,_) in table:
  text=text.replace("~","")
  result += [ f"   integer(trexio_exit_code), parameter :: {text:30s} = {code:d}" ]
result += [ "#+end_src" ]

return '\n'.join(result)

   #+end_src


   #+RESULTS:
   :results:
   #+begin_src c :tangle prefix_front.h :exports none
   #define  TREXIO_FAILURE                 ((trexio_exit_code) -1)
   #define  TREXIO_SUCCESS                 ((trexio_exit_code) 0)
   #define  TREXIO_INVALID_ARG_1           ((trexio_exit_code) 1)
   #define  TREXIO_INVALID_ARG_2           ((trexio_exit_code) 2)
   #define  TREXIO_INVALID_ARG_3           ((trexio_exit_code) 3)
   #define  TREXIO_INVALID_ARG_4           ((trexio_exit_code) 4)
   #define  TREXIO_INVALID_ARG_5           ((trexio_exit_code) 5)
   #define  TREXIO_END                     ((trexio_exit_code) 6)
   #define  TREXIO_READONLY                ((trexio_exit_code) 7)
   #define  TREXIO_ERRNO                   ((trexio_exit_code) 8)
   #define  TREXIO_INVALID_ID              ((trexio_exit_code) 9)
   #define  TREXIO_ALLOCATION_FAILED       ((trexio_exit_code) 10)
   #define  TREXIO_HAS_NOT                 ((trexio_exit_code) 11)
   #define  TREXIO_INVALID_NUM             ((trexio_exit_code) 12)
   #define  TREXIO_NUM_ALREADY_EXISTS      ((trexio_exit_code) 13)
   #define  TREXIO_DSET_ALREADY_EXISTS     ((trexio_exit_code) 14)
   #define  TREXIO_OPEN_ERROR              ((trexio_exit_code) 15)
   #define  TREXIO_LOCK_ERROR              ((trexio_exit_code) 16)
   #define  TREXIO_UNLOCK_ERROR            ((trexio_exit_code) 17)
   #define  TREXIO_FILE_ERROR              ((trexio_exit_code) 18)
   #define  TREXIO_GROUP_READ_ERROR        ((trexio_exit_code) 19)
   #define  TREXIO_GROUP_WRITE_ERROR       ((trexio_exit_code) 20)
   #define  TREXIO_ELEM_READ_ERROR         ((trexio_exit_code) 21)
   #define  TREXIO_ELEM_WRITE_ERROR        ((trexio_exit_code) 22)
   #+end_src

   #+begin_src f90 :tangle prefix_fortran.f90 :exports none
      integer(trexio_exit_code), parameter :: TREXIO_FAILURE                 = -1
      integer(trexio_exit_code), parameter :: TREXIO_SUCCESS                 = 0
      integer(trexio_exit_code), parameter :: TREXIO_INVALID_ARG_1           = 1
      integer(trexio_exit_code), parameter :: TREXIO_INVALID_ARG_2           = 2
      integer(trexio_exit_code), parameter :: TREXIO_INVALID_ARG_3           = 3
      integer(trexio_exit_code), parameter :: TREXIO_INVALID_ARG_4           = 4
      integer(trexio_exit_code), parameter :: TREXIO_INVALID_ARG_5           = 5
      integer(trexio_exit_code), parameter :: TREXIO_END                     = 6
      integer(trexio_exit_code), parameter :: TREXIO_READONLY                = 7
      integer(trexio_exit_code), parameter :: TREXIO_ERRNO                   = 8
      integer(trexio_exit_code), parameter :: TREXIO_INVALID_ID              = 9
      integer(trexio_exit_code), parameter :: TREXIO_ALLOCATION_FAILED       = 10
      integer(trexio_exit_code), parameter :: TREXIO_HAS_NOT                 = 11
      integer(trexio_exit_code), parameter :: TREXIO_INVALID_NUM             = 12
      integer(trexio_exit_code), parameter :: TREXIO_NUM_ALREADY_EXISTS      = 13
      integer(trexio_exit_code), parameter :: TREXIO_DSET_ALREADY_EXISTS     = 14
      integer(trexio_exit_code), parameter :: TREXIO_OPEN_ERROR              = 15
      integer(trexio_exit_code), parameter :: TREXIO_LOCK_ERROR              = 16
      integer(trexio_exit_code), parameter :: TREXIO_UNLOCK_ERROR            = 17
      integer(trexio_exit_code), parameter :: TREXIO_FILE_ERROR              = 18
      integer(trexio_exit_code), parameter :: TREXIO_GROUP_READ_ERROR        = 19
      integer(trexio_exit_code), parameter :: TREXIO_GROUP_WRITE_ERROR       = 20
      integer(trexio_exit_code), parameter :: TREXIO_ELEM_READ_ERROR         = 21
      integer(trexio_exit_code), parameter :: TREXIO_ELEM_WRITE_ERROR        = 22
   #+end_src
   :end:

   The ~trexio_string_of_error~ converts an exit code into a string. The
   string is assumed to be large enough to contain the error message
   (typically 128 characters).

◉ Decoding errors

   To decode the error messages, ~trexio_string_of_error~ converts an
   error code into a string.

   #+NAME: MAX_STRING_LENGTH
   : 128

   #+begin_src c :tangle prefix_front.h :exports none :noweb yes
const char* trexio_string_of_error(const trexio_exit_code error);
void trexio_string_of_error_f(const trexio_exit_code error, char result[<<MAX_STRING_LENGTH()>>]);
   #+end_src

   The text strings are extracted from the previous table.

   #+NAME:cases
   #+begin_src python :var table=table-exit-codes :exports none :noweb yes
""" This script extracts the text associated with the error codes
    from the table.
"""

result = []
for (text, code, message) in table:
  text = text.replace("~","")
  message = message.replace("'",'"')
  result += [ f"""case {text}:
  return {message};
  break;""" ]
return '\n'.join(result)

   #+end_src

   #+RESULTS: cases
   #+begin_example
   case TREXIO_FAILURE:
     return "Unknown failure";
     break;
   case TREXIO_SUCCESS:
     return "Success";
     break;
   case TREXIO_INVALID_ARG_1:
     return "Invalid argument 1";
     break;
   case TREXIO_INVALID_ARG_2:
     return "Invalid argument 2";
     break;
   case TREXIO_INVALID_ARG_3:
     return "Invalid argument 3";
     break;
   case TREXIO_INVALID_ARG_4:
     return "Invalid argument 4";
     break;
   case TREXIO_INVALID_ARG_5:
     return "Invalid argument 5";
     break;
   case TREXIO_END:
     return "End of file";
     break;
   case TREXIO_READONLY:
     return "Read-only file";
     break;
   case TREXIO_ERRNO:
     return strerror(errno);
     break;
   case TREXIO_INVALID_ID:
     return "Invalid ID";
     break;
   case TREXIO_ALLOCATION_FAILED:
     return "Allocation failed";
     break;
   case TREXIO_HAS_NOT:
     return "Element absent";
     break;
   case TREXIO_INVALID_NUM:
     return "Invalid dimensions";
     break;
   case TREXIO_NUM_ALREADY_EXISTS:
     return "Variable already exists";
     break;
   case TREXIO_OPEN_ERROR:
     return "Error opening file";
     break;
   case TREXIO_LOCK_ERROR:
     return "Error locking file";
     break;
   case TREXIO_UNLOCK_ERROR:
     return "Error unlocking file";
     break;
   case TREXIO_FILE_ERROR:
     return "Invalid file handle";
     break;
   case TREXIO_GROUP_READ_ERROR:
     return "Error reading group";
     break;
   case TREXIO_GROUP_WRITE_ERROR:
     return "Error writing group";
     break;
   case TREXIO_ELEM_READ_ERROR:
     return "Error reading element";
     break;
   case TREXIO_ELEM_WRITE_ERROR:
     return "Error writing element";
     break;
   #+end_example

   # Source
   #+begin_src c :tangle prefix_front.c :noweb yes
const char*
trexio_string_of_error (const trexio_exit_code error)
{
  switch (error) {
  <<cases()>>
  }
  return "Unknown error";
}

void
trexio_string_of_error_f (const trexio_exit_code error, char result[<<MAX_STRING_LENGTH()>>])
{
  strncpy(result, trexio_string_of_error(error), <<MAX_STRING_LENGTH()>>);
}
   #+end_src

  # Fortran interface
  #+begin_src f90 :tangle prefix_fortran.f90 :noexport :noweb yes
interface
   subroutine trexio_string_of_error (error, string) bind(C, name='trexio_string_of_error_f')
     use, intrinsic :: iso_c_binding
     import
     integer (trexio_exit_code), intent(in), value :: error
     character, intent(out) :: string(<<MAX_STRING_LENGTH()>>)
   end subroutine trexio_string_of_error
end interface
  #+end_src

