templator_front.html

<div id="outline-container-org0cf9a25" class="outline-3">
<h3 id="org0cf9a25"><span class="section-number-3">2.1</span> Error handling</h3>
<div class="outline-text-3" id="text-2-1">
<table id="orgd310c63" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Macro</th>
<th scope="col" class="org-right">Code</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>TREXIO_FAILURE</code></td>
<td class="org-right">-1</td>
<td class="org-left">'Unknown failure'</td>
</tr>

<tr>
<td class="org-left"><code>TREXIO_SUCCESS</code></td>
<td class="org-right">0</td>
<td class="org-left">'Success'</td>
</tr>

<tr>
<td class="org-left"><code>TREXIO_INVALID_ARG_1</code></td>
<td class="org-right">1</td>
<td class="org-left">'Invalid argument 1'</td>
</tr>

<tr>
<td class="org-left"><code>TREXIO_INVALID_ARG_2</code></td>
<td class="org-right">2</td>
<td class="org-left">'Invalid argument 2'</td>
</tr>

<tr>
<td class="org-left"><code>TREXIO_INVALID_ARG_3</code></td>
<td class="org-right">3</td>
<td class="org-left">'Invalid argument 3'</td>
</tr>

<tr>
<td class="org-left"><code>TREXIO_INVALID_ARG_4</code></td>
<td class="org-right">4</td>
<td class="org-left">'Invalid argument 4'</td>
</tr>

<tr>
<td class="org-left"><code>TREXIO_INVALID_ARG_5</code></td>
<td class="org-right">5</td>
<td class="org-left">'Invalid argument 5'</td>
</tr>

<tr>
<td class="org-left"><code>TREXIO_END</code></td>
<td class="org-right">6</td>
<td class="org-left">'End of file'</td>
</tr>

<tr>
<td class="org-left"><code>TREXIO_READONLY</code></td>
<td class="org-right">7</td>
<td class="org-left">'Read-only file'</td>
</tr>

<tr>
<td class="org-left"><code>TREXIO_ERRNO</code></td>
<td class="org-right">8</td>
<td class="org-left">strerror(errno)</td>
</tr>

<tr>
<td class="org-left"><code>TREXIO_INVALID_ID</code></td>
<td class="org-right">9</td>
<td class="org-left">'Invalid ID'</td>
</tr>

<tr>
<td class="org-left"><code>TREXIO_ALLOCATION_FAILED</code></td>
<td class="org-right">10</td>
<td class="org-left">'Allocation failed'</td>
</tr>

<tr>
<td class="org-left"><code>TREXIO_HAS_NOT</code></td>
<td class="org-right">11</td>
<td class="org-left">'Element absent'</td>
</tr>

<tr>
<td class="org-left"><code>TREXIO_INVALID_NUM</code></td>
<td class="org-right">12</td>
<td class="org-left">'Invalid dimensions'</td>
</tr>

<tr>
<td class="org-left"><code>TREXIO_NUM_ALREADY_EXISTS</code></td>
<td class="org-right">13</td>
<td class="org-left">'Dimensioning variable already exists'</td>
</tr>

<tr>
<td class="org-left"><code>TREXIO_DSET_ALREADY_EXISTS</code></td>
<td class="org-right">14</td>
<td class="org-left">'Dataset already exists'</td>
</tr>

<tr>
<td class="org-left"><code>TREXIO_OPEN_ERROR</code></td>
<td class="org-right">15</td>
<td class="org-left">'Error opening file'</td>
</tr>

<tr>
<td class="org-left"><code>TREXIO_LOCK_ERROR</code></td>
<td class="org-right">16</td>
<td class="org-left">'Error locking file'</td>
</tr>

<tr>
<td class="org-left"><code>TREXIO_UNLOCK_ERROR</code></td>
<td class="org-right">17</td>
<td class="org-left">'Error unlocking file'</td>
</tr>

<tr>
<td class="org-left"><code>TREXIO_FILE_ERROR</code></td>
<td class="org-right">18</td>
<td class="org-left">'Invalid file handle'</td>
</tr>

<tr>
<td class="org-left"><code>TREXIO_GROUP_READ_ERROR</code></td>
<td class="org-right">19</td>
<td class="org-left">'Error reading group'</td>
</tr>

<tr>
<td class="org-left"><code>TREXIO_GROUP_WRITE_ERROR</code></td>
<td class="org-right">20</td>
<td class="org-left">'Error writing group'</td>
</tr>

<tr>
<td class="org-left"><code>TREXIO_ELEM_READ_ERROR</code></td>
<td class="org-right">21</td>
<td class="org-left">'Error reading element'</td>
</tr>

<tr>
<td class="org-left"><code>TREXIO_ELEM_WRITE_ERROR</code></td>
<td class="org-right">22</td>
<td class="org-left">'Error writing element'</td>
</tr>
</tbody>
</table>

<p>
The <code>trexio_string_of_error</code> converts an exit code into a string. The
string is assumed to be large enough to contain the error message
(typically 128 characters).
</p>

<p>
◉ Decoding errors
</p>

<p>
To decode the error messages, <code>trexio_string_of_error</code> converts an
error code into a string.
</p>

<pre class="example">
128

</pre>

<p>
The text strings are extracted from the previous table.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span>*
<span style="color: #0000ff;">trexio_string_of_error</span> (<span style="color: #a020f0;">const</span> <span style="color: #228b22;">trexio_exit_code</span> <span style="color: #a0522d;">error</span>)
{
  <span style="color: #a020f0;">switch</span> (error) {
  <span style="color: #a020f0;">case</span> TREXIO_FAILURE:
          <span style="color: #a020f0;">return</span> <span style="color: #8b2252;">"Unknown failure"</span>;
          <span style="color: #a020f0;">break</span>;
  <span style="color: #a020f0;">case</span> TREXIO_SUCCESS:
          <span style="color: #a020f0;">return</span> <span style="color: #8b2252;">"Success"</span>;
          <span style="color: #a020f0;">break</span>;
  <span style="color: #a020f0;">case</span> TREXIO_INVALID_ARG_1:
          <span style="color: #a020f0;">return</span> <span style="color: #8b2252;">"Invalid argument 1"</span>;
          <span style="color: #a020f0;">break</span>;
  <span style="color: #a020f0;">case</span> TREXIO_INVALID_ARG_2:
          <span style="color: #a020f0;">return</span> <span style="color: #8b2252;">"Invalid argument 2"</span>;
          <span style="color: #a020f0;">break</span>;
  <span style="color: #a020f0;">case</span> TREXIO_INVALID_ARG_3:
          <span style="color: #a020f0;">return</span> <span style="color: #8b2252;">"Invalid argument 3"</span>;
          <span style="color: #a020f0;">break</span>;
  <span style="color: #a020f0;">case</span> TREXIO_INVALID_ARG_4:
          <span style="color: #a020f0;">return</span> <span style="color: #8b2252;">"Invalid argument 4"</span>;
          <span style="color: #a020f0;">break</span>;
  <span style="color: #a020f0;">case</span> TREXIO_INVALID_ARG_5:
          <span style="color: #a020f0;">return</span> <span style="color: #8b2252;">"Invalid argument 5"</span>;
          <span style="color: #a020f0;">break</span>;
  <span style="color: #a020f0;">case</span> TREXIO_END:
          <span style="color: #a020f0;">return</span> <span style="color: #8b2252;">"End of file"</span>;
          <span style="color: #a020f0;">break</span>;
  <span style="color: #a020f0;">case</span> TREXIO_READONLY:
          <span style="color: #a020f0;">return</span> <span style="color: #8b2252;">"Read-only file"</span>;
          <span style="color: #a020f0;">break</span>;
  <span style="color: #a020f0;">case</span> TREXIO_ERRNO:
          <span style="color: #a020f0;">return</span> strerror(errno);
          <span style="color: #a020f0;">break</span>;
  <span style="color: #a020f0;">case</span> TREXIO_INVALID_ID:
          <span style="color: #a020f0;">return</span> <span style="color: #8b2252;">"Invalid ID"</span>;
          <span style="color: #a020f0;">break</span>;
  <span style="color: #a020f0;">case</span> TREXIO_ALLOCATION_FAILED:
          <span style="color: #a020f0;">return</span> <span style="color: #8b2252;">"Allocation failed"</span>;
          <span style="color: #a020f0;">break</span>;
  <span style="color: #a020f0;">case</span> TREXIO_HAS_NOT:
          <span style="color: #a020f0;">return</span> <span style="color: #8b2252;">"Element absent"</span>;
          <span style="color: #a020f0;">break</span>;
  <span style="color: #a020f0;">case</span> TREXIO_INVALID_NUM:
          <span style="color: #a020f0;">return</span> <span style="color: #8b2252;">"Invalid dimensions"</span>;
          <span style="color: #a020f0;">break</span>;
  <span style="color: #a020f0;">case</span> TREXIO_NUM_ALREADY_EXISTS:
          <span style="color: #a020f0;">return</span> <span style="color: #8b2252;">"Dimensioning variable already exists"</span>;
          <span style="color: #a020f0;">break</span>;
  <span style="color: #a020f0;">case</span> TREXIO_DSET_ALREADY_EXISTS:
          <span style="color: #a020f0;">return</span> <span style="color: #8b2252;">"Dataset already exists"</span>;
          <span style="color: #a020f0;">break</span>;
  <span style="color: #a020f0;">case</span> TREXIO_OPEN_ERROR:
          <span style="color: #a020f0;">return</span> <span style="color: #8b2252;">"Error opening file"</span>;
          <span style="color: #a020f0;">break</span>;
  <span style="color: #a020f0;">case</span> TREXIO_LOCK_ERROR:
          <span style="color: #a020f0;">return</span> <span style="color: #8b2252;">"Error locking file"</span>;
          <span style="color: #a020f0;">break</span>;
  <span style="color: #a020f0;">case</span> TREXIO_UNLOCK_ERROR:
          <span style="color: #a020f0;">return</span> <span style="color: #8b2252;">"Error unlocking file"</span>;
          <span style="color: #a020f0;">break</span>;
  <span style="color: #a020f0;">case</span> TREXIO_FILE_ERROR:
          <span style="color: #a020f0;">return</span> <span style="color: #8b2252;">"Invalid file handle"</span>;
          <span style="color: #a020f0;">break</span>;
  <span style="color: #a020f0;">case</span> TREXIO_GROUP_READ_ERROR:
          <span style="color: #a020f0;">return</span> <span style="color: #8b2252;">"Error reading group"</span>;
          <span style="color: #a020f0;">break</span>;
  <span style="color: #a020f0;">case</span> TREXIO_GROUP_WRITE_ERROR:
          <span style="color: #a020f0;">return</span> <span style="color: #8b2252;">"Error writing group"</span>;
          <span style="color: #a020f0;">break</span>;
  <span style="color: #a020f0;">case</span> TREXIO_ELEM_READ_ERROR:
          <span style="color: #a020f0;">return</span> <span style="color: #8b2252;">"Error reading element"</span>;
          <span style="color: #a020f0;">break</span>;
  <span style="color: #a020f0;">case</span> TREXIO_ELEM_WRITE_ERROR:
          <span style="color: #a020f0;">return</span> <span style="color: #8b2252;">"Error writing element"</span>;
          <span style="color: #a020f0;">break</span>;
  }
  <span style="color: #a020f0;">return</span> <span style="color: #8b2252;">"Unknown error"</span>;
}

<span style="color: #228b22;">void</span>
<span style="color: #0000ff;">trexio_string_of_error_f</span> (<span style="color: #a020f0;">const</span> <span style="color: #228b22;">trexio_exit_code</span> <span style="color: #a0522d;">error</span>, <span style="color: #228b22;">char</span> <span style="color: #a0522d;">result</span>[128])
{
  strncpy(result, trexio_string_of_error(error), 128);
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-f90"><span style="color: #a020f0;">interface</span>
   <span style="color: #a020f0;">subroutine</span> <span style="color: #0000ff;">trexio_string_of_error</span> (error, string) <span style="color: #a020f0;">bind</span>(C, name=<span style="color: #8b2252;">'trexio_string_of_error_f'</span>)
     <span style="color: #a020f0;">use</span>, <span style="color: #a020f0;">intrinsic</span> :: <span style="color: #0000ff;">iso_c_binding</span>
     <span style="color: #a020f0;">import</span>
     <span style="color: #228b22;">integer</span> (trexio_exit_code), <span style="color: #a020f0;">intent</span>(in), <span style="color: #a020f0;">value</span> ::<span style="color: #a0522d;"> error</span>
     <span style="color: #228b22;">character</span>, <span style="color: #a020f0;">intent</span>(out) ::<span style="color: #a0522d;"> string(128)</span>
   <span style="color: #a020f0;">end subroutine</span> <span style="color: #0000ff;">trexio_string_of_error</span>
<span style="color: #a020f0;">end interface</span>
</pre>
</div>
</div>
</div>
