templator_front.html

<div id="outline-container-org441bc37" class="outline-3">
<h3 id="org441bc37"><span class="section-number-3">2.2</span> Back ends</h3>
<div class="outline-text-3" id="text-2-2">
<p>
TREXIO has several back ends:
</p>

<ol class="org-ol">
<li><code>TREXIO_HDF5</code> relies on extensive use of the HDF5 library and the associated file format. The HDF5 file is binary and tailored to high-performance I/O. This back end is the default one. HDF5 can be compiled with MPI for parallel I/O. Note, that HDF5 has to be downloaded and installed independently of TREXIO, which may cause some obstacles, especially when the user is not allowed to install external software. The produced files usually have <code>.h5</code> extension.</li>

<li><code>TREXIO_TEXT</code> relies on basic file I/O in C, namely <code>fopen, fclose, fprintf, fscanf</code> etc. from <code>stdio.h</code> library. This back end is not optimized for performance. It is supposed to be used for debug purposes or, for example, when the user wants to modify some data manually within the file. This back end is supposed to work "out-of-the-box" since there are no external dependencies, which might be useful for users that do not have access to HDF5 library. The produced files usually have <code>.txt</code> extension.</li>
</ol>

<p>
Additional back ends can be implemented thanks to the modular nature of the front end.
This can be achieved by adding a new <code>case</code> (corresponding to the desired back end) in the front-end <code>switch</code>.
Then the corresponding back-end <code>has/read/write</code> functions has to be implemented. For example, see the commented
lines that correspond to the <code>TREXIO_JSON</code> back end (not implemented yet).
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #a020f0;">typedef</span> <span style="color: #228b22;">int32_t</span> <span style="color: #228b22;">back_end_t</span>;

<span style="color: #483d8b;">#define</span> <span style="color: #a0522d;">TREXIO_HDF5</span>             ( (<span style="color: #228b22;">back_end_t</span>) 0 )
<span style="color: #483d8b;">#define</span> <span style="color: #a0522d;">TREXIO_TEXT</span>             ( (<span style="color: #228b22;">back_end_t</span>) 1 )
/*<span style="color: #b22222;">#define TREXIO_JSON             ( (back_end_t) 2 )</span>*/
<span style="color: #483d8b;">#define</span> <span style="color: #a0522d;">TREXIO_INVALID_BACK_END</span> ( (<span style="color: #228b22;">back_end_t</span>) 2 )
</pre>
</div>
</div>
</div>
<div id="outline-container-org92825c2" class="outline-3">
<h3 id="org92825c2"><span class="section-number-3">2.3</span> Read/write behavior</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Every time a reading function is called, the data is read from the
disk. If data needs to be cached, this is left to the user of the
library.
</p>

<p>
Writing to TREXIO files is done with transactions (all-or-nothing
effect) in a per-group fashion.  File writes are attempted by
calling explicitly the write (<code>TREXIO_HDF5</code>) or flush (<code>TREXIO_TEXT</code>)
function, or when the TREXIO file is closed.
If writing is impossible because the data is not valid, no data is written.
</p>

<p>
The order in which the data is written is not necessarily consistent
with the order in which the function calls were made.
</p>

<p>
The TREXIO files are supposed to be opened by only one program at a
time: if the same TREXIO file is modified simultaneously by multiple
concurrent programs, the behavior is not specified.
</p>
</div>
</div>
<div id="outline-container-org6bc2172" class="outline-3">
<h3 id="org6bc2172"><span class="section-number-3">2.4</span> TREXIO file type</h3>
<div class="outline-text-3" id="text-2-4">
<p>
<code>trexio_s</code> is the the main type for TREXIO files, visible to the users
of the library. This type is kept opaque, and all modifications to
the files will be necessarily done through the use of functions,
taking such a type as argument.
</p>

<p>
File creation and opening functions will return <i>TREXIO file handles</i>,
namely pointers to <code>trexio_s</code> types. All functions accessing to the
TREXIO files will have as a first argument the TREXIO file handle.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">trexio_s</span> <span style="color: #228b22;">trexio_t</span>;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #a020f0;">struct</span> <span style="color: #228b22;">trexio_s</span> {
  <span style="color: #228b22;">char</span>*             <span style="color: #a0522d;">file_name</span>;
  <span style="color: #228b22;">pthread_mutex_t</span>   <span style="color: #a0522d;">thread_lock</span>;
  <span style="color: #228b22;">back_end_t</span>        <span style="color: #a0522d;">back_end</span>;
  <span style="color: #228b22;">char</span>              <span style="color: #a0522d;">mode</span>;
  <span style="color: #228b22;">char</span>              <span style="color: #a0522d;">padding</span>[7];   /* <span style="color: #b22222;">Ensures the proper alignment of back ends </span>*/
};
</pre>
</div>
</div>
</div>
<div id="outline-container-org28aaa0a" class="outline-3">
<h3 id="org28aaa0a"><span class="section-number-3">2.5</span> Polymorphism of the file handle</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Polymorphism of the <code>trexio_t</code> type is handled by ensuring that the
corresponding types for all back ends can be safely casted to
<code>trexio_t</code>. This is done by making the back-end structs start with
<code>struct trexio_s</code>:
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #a020f0;">struct</span> <span style="color: #228b22;">trexio_back_end_s</span> {
  <span style="color: #228b22;">trexio_t</span>     <span style="color: #a0522d;">parent</span> ;
  /* <span style="color: #b22222;">add below specific back-end data </span>*/
}
</pre>
</div>
</div>
</div>
