templator_front.html

<div id="outline-container-orgb12e187" class="outline-3">
<h3 id="orgb12e187"><span class="section-number-3">2.6</span> File opening</h3>
<div class="outline-text-3" id="text-2-6">
<p>
<code>trexio_open</code> creates a new TREXIO file or opens existing one.
</p>

<p>
input parameters:
</p>
<ol class="org-ol">
<li><code>file_name</code>     - string containing file name</li>
<li><code>mode</code>          - character containing open mode (see below)
<ul class="org-ul">
<li><code>'w'</code>         - (write)  creates a new file as READWRITE (overwrite existing file)</li>
<li><code>'r'</code>         - (read)   opens existing file as READONLY</li>
</ul></li>
<li><code>back_end</code>      - integer number (or the corresponding global parameter) specifying the back end
<ul class="org-ul">
<li><code>TREXIO_HDF5</code> - for HDF5 back end (integer alternative: 0)</li>
<li><code>TREXIO_TEXT</code> - for TEXT back end (integer alternative: 1)</li>
</ul></li>
</ol>

<p>
output:
  <code>trexio_t</code> file handle
</p>

<p>
Note: the <code>file_name</code> in TEXT back end actually corresponds to the name of the folder where <code>.txt</code>
data files are stored. The actual name of each <code>.txt</code> file corresponds to the group name provided in
<code>trex.config</code> (e.g. <code>nucleus.txt</code> for nuclei-related data).
These names are populated by the generator.py (i.e. they are hard-coded), which is why the user
should tend to avoid renaming the <code>.txt</code> data files.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_t</span>*
<span style="color: #0000ff;">trexio_open</span>(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span>* <span style="color: #a0522d;">file_name</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span> <span style="color: #a0522d;">mode</span>,
            <span style="color: #a020f0;">const</span> <span style="color: #228b22;">back_end_t</span> <span style="color: #a0522d;">back_end</span>)
{

  <span style="color: #a020f0;">if</span> (file_name == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> <span style="color: #008b8b;">NULL</span>;
  <span style="color: #a020f0;">if</span> (file_name[0] == <span style="color: #8b2252;">'\0'</span>) <span style="color: #a020f0;">return</span> <span style="color: #008b8b;">NULL</span>;
  /* <span style="color: #b22222;">Check overflow in file_name </span>*/

  <span style="color: #a020f0;">if</span> (back_end &lt;  0) <span style="color: #a020f0;">return</span> <span style="color: #008b8b;">NULL</span>;
  <span style="color: #a020f0;">if</span> (back_end &gt;= TREXIO_INVALID_BACK_END) <span style="color: #a020f0;">return</span> <span style="color: #008b8b;">NULL</span>;

  <span style="color: #a020f0;">if</span> (mode != <span style="color: #8b2252;">'r'</span> &amp;&amp; mode != <span style="color: #8b2252;">'w'</span>) <span style="color: #a020f0;">return</span> <span style="color: #008b8b;">NULL</span>;

  <span style="color: #228b22;">trexio_t</span>* <span style="color: #a0522d;">result</span> = <span style="color: #008b8b;">NULL</span>;
  <span style="color: #228b22;">void</span>* <span style="color: #a0522d;">result_tmp</span> = <span style="color: #008b8b;">NULL</span>;

  /* <span style="color: #b22222;">Allocate data structures </span>*/
  <span style="color: #a020f0;">switch</span> (back_end) {

  <span style="color: #a020f0;">case</span> TREXIO_TEXT:
    result_tmp = malloc(<span style="color: #a020f0;">sizeof</span>(trexio_text_t));
    <span style="color: #a020f0;">break</span>;

  <span style="color: #a020f0;">case</span> TREXIO_HDF5:
    result_tmp = malloc(<span style="color: #a020f0;">sizeof</span>(trexio_hdf5_t));
    <span style="color: #a020f0;">break</span>;
/*
<span style="color: #b22222;">  case TREXIO_JSON:</span>
<span style="color: #b22222;">    result = (trexio_t*) malloc (sizeof(trexio_json_t));</span>
<span style="color: #b22222;">    break;</span>
*/
  }
  result = (<span style="color: #228b22;">trexio_t</span>*) result_tmp;

  assert (result != <span style="color: #008b8b;">NULL</span>);    /* <span style="color: #b22222;">TODO: Error handling </span>*/


  /* <span style="color: #b22222;">Data for the parent type </span>*/

  result-&gt;file_name   = CALLOC(TREXIO_MAX_FILENAME_LENGTH, <span style="color: #228b22;">char</span>);
  strncpy(result-&gt;file_name, file_name, TREXIO_MAX_FILENAME_LENGTH);
  <span style="color: #a020f0;">if</span> (result-&gt;file_name[TREXIO_MAX_FILENAME_LENGTH-1] != <span style="color: #8b2252;">'\0'</span>) {
    free(result-&gt;file_name);
    free(result);
    <span style="color: #a020f0;">return</span> <span style="color: #008b8b;">NULL</span>;
  }

  result-&gt;back_end    = back_end;
  result-&gt;mode        = mode;
  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">irc</span> = pthread_mutex_init ( &amp;(result-&gt;thread_lock), <span style="color: #008b8b;">NULL</span>);
  assert (irc == 0);

  <span style="color: #228b22;">trexio_exit_code</span> <span style="color: #a0522d;">rc</span>;

  /* <span style="color: #b22222;">Back end initialization </span>*/

  rc = TREXIO_OPEN_ERROR;

  <span style="color: #a020f0;">switch</span> (back_end) {

  <span style="color: #a020f0;">case</span> TREXIO_TEXT:
    rc = trexio_text_init(result);
    <span style="color: #a020f0;">break</span>;

  <span style="color: #a020f0;">case</span> TREXIO_HDF5:
    rc = trexio_hdf5_init(result);
    <span style="color: #a020f0;">break</span>;
/*
<span style="color: #b22222;">  case TREXIO_JSON:</span>
<span style="color: #b22222;">    rc = trexio_json_init(result);</span>
<span style="color: #b22222;">    break;</span>
*/
  }

  <span style="color: #a020f0;">if</span> (rc != TREXIO_SUCCESS) {
    free(result-&gt;file_name);
    free(result);
    <span style="color: #a020f0;">return</span> <span style="color: #008b8b;">NULL</span>;
  }

  /* <span style="color: #b22222;">File locking </span>*/

  rc = TREXIO_LOCK_ERROR;

  <span style="color: #a020f0;">switch</span> (back_end) {

  <span style="color: #a020f0;">case</span> TREXIO_TEXT:
    rc = trexio_text_lock(result);
    <span style="color: #a020f0;">break</span>;
  /* <span style="color: #b22222;">HDF5 v.&gt;=1.10 has file locking activated by default </span>*/
  <span style="color: #a020f0;">case</span> TREXIO_HDF5:
    rc = TREXIO_SUCCESS;
    <span style="color: #a020f0;">break</span>;
/*
<span style="color: #b22222;">  case TREXIO_JSON:</span>
<span style="color: #b22222;">    rc = trexio_json_lock(result);</span>
<span style="color: #b22222;">    break;</span>
*/
  }

  <span style="color: #a020f0;">if</span> (rc != TREXIO_SUCCESS) {
    free(result-&gt;file_name);
    free(result);
    <span style="color: #a020f0;">return</span> <span style="color: #008b8b;">NULL</span>;
  }

  <span style="color: #a020f0;">return</span> result;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-f90"><span style="color: #a020f0;">interface</span>
   <span style="color: #228b22;">integer</span>(8) <span style="color: #a020f0;">function</span> <span style="color: #0000ff;">trexio_open_c</span> (filename, mode, backend) <span style="color: #a020f0;">bind</span>(C, name=<span style="color: #8b2252;">"trexio_open"</span>)
     <span style="color: #a020f0;">use</span>, <span style="color: #a020f0;">intrinsic</span> :: <span style="color: #0000ff;">iso_c_binding</span>
     <span style="color: #228b22;">character</span>(kind=<span style="color: #008b8b;">c_char</span>), <span style="color: #a020f0;">dimension</span>(*)  ::<span style="color: #a0522d;"> filename</span>
     <span style="color: #228b22;">character</span>, <span style="color: #a020f0;">intent</span>(in), <span style="color: #a020f0;">value</span>          ::<span style="color: #a0522d;"> mode</span>
     <span style="color: #228b22;">integer</span>, <span style="color: #a020f0;">intent</span>(in), <span style="color: #a020f0;">value</span>            ::<span style="color: #a0522d;"> backend</span>
   <span style="color: #a020f0;">end function</span> <span style="color: #0000ff;">trexio_open_c</span>
<span style="color: #a020f0;">end interface</span>
</pre>
</div>
</div>
</div>
