templator_front.html

<div id="outline-container-org0fce83e" class="outline-3">
<h3 id="org0fce83e"><span class="section-number-3">2.7</span> File closing</h3>
<div class="outline-text-3" id="text-2-7">
<p>
<code>trexio_close</code> closes an existing <code>trexio_t</code> file.
</p>

<p>
input parameters:
  <code>file</code> &#x2013; TREXIO file handle.
</p>

<p>
output:
  <code>trexio_exit_code</code> exit code.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_close</span> (<span style="color: #228b22;">trexio_t</span>* <span style="color: #a0522d;">file</span>)
{

  <span style="color: #a020f0;">if</span> (file == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_FILE_ERROR;

  <span style="color: #228b22;">trexio_exit_code</span> <span style="color: #a0522d;">rc</span> = TREXIO_FAILURE;

  assert(file-&gt;back_end &lt; TREXIO_INVALID_BACK_END);

  /* <span style="color: #b22222;">Terminate the back end </span>*/
  <span style="color: #a020f0;">switch</span> (file-&gt;back_end) {

  <span style="color: #a020f0;">case</span> TREXIO_TEXT:
    rc = trexio_text_deinit(file);
    <span style="color: #a020f0;">break</span>;

  <span style="color: #a020f0;">case</span> TREXIO_HDF5:
    rc = trexio_hdf5_deinit(file);
    <span style="color: #a020f0;">break</span>;
/*
<span style="color: #b22222;">  case TREXIO_JSON:</span>
<span style="color: #b22222;">    rc = trexio_json_deinit(file);</span>
<span style="color: #b22222;">    break;</span>
*/
  }

  <span style="color: #a020f0;">if</span> (rc != TREXIO_SUCCESS) {
    FREE(file-&gt;file_name);
    FREE(file);
    <span style="color: #a020f0;">return</span> rc;
  }

  /* <span style="color: #b22222;">File unlocking </span>*/

  rc = TREXIO_UNLOCK_ERROR;

  <span style="color: #a020f0;">switch</span> (file-&gt;back_end) {

  <span style="color: #a020f0;">case</span> TREXIO_TEXT:
    rc = trexio_text_unlock(file);
    <span style="color: #a020f0;">break</span>;

  <span style="color: #a020f0;">case</span> TREXIO_HDF5:
    rc = TREXIO_SUCCESS;
    <span style="color: #a020f0;">break</span>;
/*
<span style="color: #b22222;">  case TREXIO_JSON:</span>
<span style="color: #b22222;">    rc = trexio_json_unlock(file);</span>
<span style="color: #b22222;">    break;</span>
*/
  }

  /* <span style="color: #b22222;">Terminate front end </span>*/

  FREE(file-&gt;file_name);

  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">irc</span> = pthread_mutex_destroy( &amp;(file-&gt;thread_lock) );

  free(file);

  <span style="color: #a020f0;">if</span> (irc != 0) <span style="color: #a020f0;">return</span> TREXIO_ERRNO;
  <span style="color: #a020f0;">if</span> (rc != TREXIO_SUCCESS) <span style="color: #a020f0;">return</span> rc;

  <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-f90"><span style="color: #a020f0;">interface</span>
   <span style="color: #228b22;">integer </span><span style="color: #a020f0;">function</span><span style="color: #a0522d;"> </span><span style="color: #0000ff;">trexio_close</span><span style="color: #a0522d;"> </span><span style="color: #000000; background-color: #ffffff;">(trex_file) bind(C)</span>
     <span style="color: #a020f0;">use</span>, <span style="color: #a020f0;">intrinsic</span> :: <span style="color: #0000ff;">iso_c_binding</span>
     <span style="color: #228b22;">integer</span>(8), <span style="color: #a020f0;">intent</span>(in), <span style="color: #a020f0;">value</span> ::<span style="color: #a0522d;"> trex_file</span>
   <span style="color: #a020f0;">end function</span> <span style="color: #0000ff;">trexio_close</span>
<span style="color: #a020f0;">end interface</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org4bc7201" class="outline-3">
<h3 id="org4bc7201"><span class="section-number-3">2.8</span> C helper functions</h3>
<div class="outline-text-3" id="text-2-8">
<p>
    #+begin<sub>src</sub> c :tangle prefix<sub>front.c</sub>
trexio<sub>exit</sub><sub>code</sub> transform<sub>str</sub> (char** dest, const char** src, uint64<sub>t</sub> str<sub>max</sub><sub>num</sub>, uint32<sub>t</sub> str<sub>max</sub><sub>len</sub>){
</p>

<p>
if (dest == NULL)  return TREXIO<sub>INVALID</sub><sub>ARG</sub><sub>1</sub>;
assert (str<sub>max</sub><sub>num</sub> &gt; 0);
assert (str<sub>max</sub><sub>len</sub> &gt; 0);
</p>

<p>
char* tmp<sub>str</sub> = (char*)calloc(str<sub>max</sub><sub>num</sub>*(str<sub>max</sub><sub>len</sub>+1)+1,sizeof(char));
</p>

<p>
for (int i=0; i&lt;str<sub>max</sub><sub>num</sub>; i++){
  dest[i] = tmp<sub>str</sub>;
  strncpy(tmp<sub>str</sub>, src[i], str<sub>max</sub><sub>len</sub>);
  tmp<sub>str</sub> += str<sub>max</sub><sub>len</sub> + 1;
}
</p>

<p>
<i>*tmp<sub>str</sub> cannot be freed here but it is taken case of when pointer to dest is deallocated *</i>
</p>

<p>
  return TREXIO<sub>SUCCESS</sub>;
}
    #+end<sub>src</sub> c
</p>
</div>
</div>
</div>
