templator_front.html

<div id="outline-container-orgce5d3dc" class="outline-2">
<h2 id="orgce5d3dc"><span class="section-number-2">3</span> Templates for front end</h2>
<div class="outline-text-2" id="text-3">
<p>
Consider the following block of <code>trex.json</code>:
</p>

<div class="org-src-container">
<pre class="src src-python">{
  <span style="color: #8b2252;">"nucleus"</span>: {
      <span style="color: #8b2252;">"num"</span>                : [ <span style="color: #8b2252;">"int"</span>  , [                     ] ]
    , <span style="color: #8b2252;">"charge"</span>             : [ <span style="color: #8b2252;">"float"</span>, [ <span style="color: #8b2252;">"nucleus.num"</span>       ] ]
    , <span style="color: #8b2252;">"coord"</span>              : [ <span style="color: #8b2252;">"float"</span>, [ <span style="color: #8b2252;">"nucleus.num"</span>, <span style="color: #8b2252;">"3"</span>  ] ]
    , <span style="color: #8b2252;">"label"</span>              : [ <span style="color: #8b2252;">"str"</span> ,  [ <span style="color: #8b2252;">"nucleus.num"</span>       ] ]
  }
}
</pre>
</div>

<p>
<code>TREXIO</code> is generated automatically by the <code>generator.py</code> Python
script based on the tree-like configuration provided in the
<code>trex.json</code> file.  Because of that, generalized templates can be
implemented and re-used.  This approach minimizes the number of bugs
as compared with manual copy-paste-modify scheme.
</p>

<p>
All templates presented below use the <code>$var$</code> notation to indicate
the variable, which will be replaced by the
<code>generator.py</code>. Sometimes the upper case is used, i.e.  <code>$VAR$</code> (for
example, in <code>#define</code> statements).  More detailed description of
each variable can be found below:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Template variable</th>
<th scope="col" class="org-left">Description</th>
<th scope="col" class="org-left">Example</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>$group$</code></td>
<td class="org-left">Name of the group</td>
<td class="org-left"><code>nucleus</code></td>
</tr>

<tr>
<td class="org-left"><code>$group_num$</code></td>
<td class="org-left">Name of the dimensioning variable (scalar)</td>
<td class="org-left"><code>nucleus_num</code></td>
</tr>

<tr>
<td class="org-left"><code>$group_dset$</code></td>
<td class="org-left">Name of the dataset (vector/matrix/tensor)</td>
<td class="org-left"><code>nucleus_coord</code></td>
</tr>

<tr>
<td class="org-left"><code>$group_dset_rank$</code></td>
<td class="org-left">Rank of the dataset</td>
<td class="org-left"><code>2</code></td>
</tr>

<tr>
<td class="org-left"><code>$group_dset_dim$</code></td>
<td class="org-left">Selected dimension of the dataset</td>
<td class="org-left"><code>nucleus_num</code></td>
</tr>

<tr>
<td class="org-left"><code>$group_dset_dim_list$</code></td>
<td class="org-left">All dimensions of the dataset</td>
<td class="org-left"><code>{nucleus_num, 3}</code></td>
</tr>

<tr>
<td class="org-left"><code>$group_dset_dtype$</code></td>
<td class="org-left">Basic type of the dataset (int/float/char)</td>
<td class="org-left"><code>float</code></td>
</tr>

<tr>
<td class="org-left"><code>$group_dset_h5_dtype$</code></td>
<td class="org-left">Type of the dataset in HDF5</td>
<td class="org-left"><code>double</code></td>
</tr>

<tr>
<td class="org-left"><code>$group_dset_std_dtype_in$</code></td>
<td class="org-left">Input type of the dataset in TEXT  [fscanf]</td>
<td class="org-left"><code>%lf</code></td>
</tr>

<tr>
<td class="org-left"><code>$group_dset_std_dtype_out$</code></td>
<td class="org-left">Output type of the dataset in TEXT [fprintf]</td>
<td class="org-left"><code>%24.16e</code></td>
</tr>

<tr>
<td class="org-left"><code>$group_dset_dtype_default$</code></td>
<td class="org-left">Default datatype of the dataset [C]</td>
<td class="org-left"><code>double/int32_t</code></td>
</tr>

<tr>
<td class="org-left"><code>$group_dset_dtype_single$</code></td>
<td class="org-left">Single precision datatype of the dataset [C]</td>
<td class="org-left"><code>float/int32_t</code></td>
</tr>

<tr>
<td class="org-left"><code>$group_dset_dtype_double$</code></td>
<td class="org-left">Double precision datatype of the dataset [C]</td>
<td class="org-left"><code>double/int64_t</code></td>
</tr>

<tr>
<td class="org-left"><code>$default_prec$</code></td>
<td class="org-left">Default precision for read/write without suffix [C]</td>
<td class="org-left"><code>64/32</code></td>
</tr>

<tr>
<td class="org-left"><code>$group_dset_f_dtype_default$</code></td>
<td class="org-left">Default datatype of the dataset [Fortran]</td>
<td class="org-left"><code>real(8)/integer(4)</code></td>
</tr>

<tr>
<td class="org-left"><code>$group_dset_f_dtype_single$</code></td>
<td class="org-left">Single precision datatype of the dataset [Fortran]</td>
<td class="org-left"><code>real(4)/integer(4)</code></td>
</tr>

<tr>
<td class="org-left"><code>$group_dset_f_dtype_double$</code></td>
<td class="org-left">Double precision datatype of the dataset [Fortran]</td>
<td class="org-left"><code>real(8)/integer(8)</code></td>
</tr>

<tr>
<td class="org-left"><code>$group_dset_f_dims$</code></td>
<td class="org-left">Dimensions in Fortran</td>
<td class="org-left"><code>(:,:)</code></td>
</tr>
</tbody>
</table>


<p>
Note: parent group name is always added to the child objects upon
construction of TREXIO (e.g. <code>num</code> of <code>nucleus</code> group becomes
<code>nucleus_num</code> and should be accessed accordingly within TREXIO).
</p>

<p>
TREXIO generator parses the <code>trex.json</code> file. TREXIO operates with
names of variables based on the 1-st (parent group) and 2-nd (child
object) levels of <code>trex.json</code> .  The parsed data is divided in 2
parts:
</p>

<ol class="org-ol">
<li>Dimensioning variables (contain <code>num</code> in their names). These are always scalar integers.</li>
<li>Datasets. These can be vectors, matrices or tensors. The types are indicated in <code>trex.json</code>.
Currently supported types: int, float and strings.</li>
</ol>

<p>
For each of the aforementioned objects, TREXIO provides <b>has</b>,
<b>read</b> and <b>write</b> functionality.  TREXIO supports I/O with single
or double precision for integer and floating point numbers.
</p>
</div>

<div id="outline-container-orgb2af4b7" class="outline-3">
<h3 id="orgb2af4b7"><span class="section-number-3">3.1</span> Templates for front end has/read/write a dimension</h3>
<div class="outline-text-3" id="text-3-1">
<p>
This section concerns API calls related to dimensioning variables.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Function name</th>
<th scope="col" class="org-left">Description</th>
<th scope="col" class="org-left">Precision</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>trexio_has_$group_num$</code></td>
<td class="org-left">Check if a dimensioning variable exists in a file</td>
<td class="org-left">---</td>
</tr>

<tr>
<td class="org-left"><code>trexio_read_$group_num$</code></td>
<td class="org-left">Read a dimensioning variable</td>
<td class="org-left">Single</td>
</tr>

<tr>
<td class="org-left"><code>trexio_write_$group_num$</code></td>
<td class="org-left">Write a dimensioning variable</td>
<td class="org-left">Single</td>
</tr>

<tr>
<td class="org-left"><code>trexio_read_$group_num$_32</code></td>
<td class="org-left">Read a dimensioning variable</td>
<td class="org-left">Single</td>
</tr>

<tr>
<td class="org-left"><code>trexio_write_$group_num$_32</code></td>
<td class="org-left">Write a dimensioning variable</td>
<td class="org-left">Single</td>
</tr>

<tr>
<td class="org-left"><code>trexio_read_$group_num$_64</code></td>
<td class="org-left">Read a dimensioning variable</td>
<td class="org-left">Double</td>
</tr>

<tr>
<td class="org-left"><code>trexio_write_$group_num$_64</code></td>
<td class="org-left">Write a dimensioning variable</td>
<td class="org-left">Double</td>
</tr>
</tbody>
</table>
</div>
