templator_front.html

<div id="outline-container-org95e34d4" class="outline-4">
<h4 id="org95e34d4"><span class="section-number-4">3.1.1</span> C templates for front end</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
The <code>C</code> templates that correspond to each of the abovementioned
functions can be found below.  First parameter is the <code>TREXIO</code> file
handle. Second parameter is the variable to be written/read
to/from the <code>TREXIO</code> file (except for <code>trexio_has_</code> functions).
Suffixes <code>_32</code> and <code>_64</code> correspond to API calls dealing with
single and double precision, respectively.  The basic
(non-suffixed) API call on dimensioning variables deals with single
precision (see Table above).
</p>


<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_read_$group_num$_64</span> (<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>, <span style="color: #228b22;">int64_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">num</span>)
{
  <span style="color: #a020f0;">if</span> (file == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;

  <span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">u_num</span> = 0;
  <span style="color: #228b22;">trexio_exit_code</span> <span style="color: #a0522d;">rc</span> = TREXIO_GROUP_READ_ERROR;

  <span style="color: #a020f0;">switch</span> (file-&gt;back_end) {

  <span style="color: #a020f0;">case</span> TREXIO_TEXT:
    rc = trexio_text_read_$group_num$(file, &amp;u_num);
    <span style="color: #a020f0;">break</span>;

  <span style="color: #a020f0;">case</span> TREXIO_HDF5:
    rc = trexio_hdf5_read_$group_num$(file, &amp;u_num);
    <span style="color: #a020f0;">break</span>;
/*
<span style="color: #b22222;">  case TREXIO_JSON:</span>
<span style="color: #b22222;">    rc =trexio_json_read_$group_num$(file, &amp;u_num);</span>
<span style="color: #b22222;">    break;</span>
*/
  }

  <span style="color: #a020f0;">if</span> (rc != TREXIO_SUCCESS) <span style="color: #a020f0;">return</span> rc;

  *num = (<span style="color: #228b22;">int64_t</span>) u_num;
  <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_write_$group_num$_64</span> (<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">num</span>)
{
  <span style="color: #a020f0;">if</span> (file == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;
  <span style="color: #a020f0;">if</span> (num  &lt;  0   ) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_2;
  <span style="color: #a020f0;">if</span> (trexio_has_$group_num$(file) == TREXIO_SUCCESS) <span style="color: #a020f0;">return</span> TREXIO_NUM_ALREADY_EXISTS;

  <span style="color: #228b22;">trexio_exit_code</span> <span style="color: #a0522d;">rc</span> = TREXIO_GROUP_WRITE_ERROR;

  <span style="color: #a020f0;">switch</span> (file-&gt;back_end) {

  <span style="color: #a020f0;">case</span> TREXIO_TEXT:
    rc = trexio_text_write_$group_num$(file, (<span style="color: #228b22;">int64_t</span>) num);
    <span style="color: #a020f0;">break</span>;

  <span style="color: #a020f0;">case</span> TREXIO_HDF5:
    rc = trexio_hdf5_write_$group_num$(file, (<span style="color: #228b22;">int64_t</span>) num);
    <span style="color: #a020f0;">break</span>;
/*
<span style="color: #b22222;">  case TREXIO_JSON:</span>
<span style="color: #b22222;">    rc = trexio_json_write_$group_num$(file, (int64_t) num);</span>
<span style="color: #b22222;">    break;</span>
*/
  }
  <span style="color: #a020f0;">if</span> (rc != TREXIO_SUCCESS) <span style="color: #a020f0;">return</span> rc;

  <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_read_$group_num$_32</span> (<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>, <span style="color: #228b22;">int32_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">num</span>)
{
  <span style="color: #a020f0;">if</span> (file == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;

  <span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">u_num</span> = 0;
  <span style="color: #228b22;">trexio_exit_code</span> <span style="color: #a0522d;">rc</span> = TREXIO_GROUP_READ_ERROR;

  <span style="color: #a020f0;">switch</span> (file-&gt;back_end) {

  <span style="color: #a020f0;">case</span> TREXIO_TEXT:
    rc = trexio_text_read_$group_num$(file, &amp;u_num);
    <span style="color: #a020f0;">break</span>;

  <span style="color: #a020f0;">case</span> TREXIO_HDF5:
    rc = trexio_hdf5_read_$group_num$(file, &amp;u_num);
    <span style="color: #a020f0;">break</span>;
/*
<span style="color: #b22222;">  case TREXIO_JSON:</span>
<span style="color: #b22222;">    rc =trexio_json_read_$group_num$(file, &amp;u_num);</span>
<span style="color: #b22222;">    break;</span>
*/
  }

  <span style="color: #a020f0;">if</span> (rc != TREXIO_SUCCESS) <span style="color: #a020f0;">return</span> rc;

  *num = (<span style="color: #228b22;">int32_t</span>) u_num;
  <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_write_$group_num$_32</span> (<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int32_t</span> <span style="color: #a0522d;">num</span>)
{

  <span style="color: #a020f0;">if</span> (file == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;
  <span style="color: #a020f0;">if</span> (num  &lt;  0   ) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_2;
  <span style="color: #a020f0;">if</span> (trexio_has_$group_num$(file) == TREXIO_SUCCESS) <span style="color: #a020f0;">return</span> TREXIO_NUM_ALREADY_EXISTS;

  <span style="color: #228b22;">trexio_exit_code</span> <span style="color: #a0522d;">rc</span> = TREXIO_GROUP_WRITE_ERROR;

  <span style="color: #a020f0;">switch</span> (file-&gt;back_end) {

  <span style="color: #a020f0;">case</span> TREXIO_TEXT:
    rc = trexio_text_write_$group_num$(file, (<span style="color: #228b22;">int64_t</span>) num);
    <span style="color: #a020f0;">break</span>;

  <span style="color: #a020f0;">case</span> TREXIO_HDF5:
    rc = trexio_hdf5_write_$group_num$(file, (<span style="color: #228b22;">int64_t</span>) num);
    <span style="color: #a020f0;">break</span>;
/*
<span style="color: #b22222;">  case TREXIO_JSON:</span>
<span style="color: #b22222;">    rc = trexio_json_write_$group_num$(file, (int64_t) num);</span>
<span style="color: #b22222;">    break;</span>
*/
  }
  <span style="color: #a020f0;">if</span> (rc != TREXIO_SUCCESS) <span style="color: #a020f0;">return</span> rc;

  <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_read_$group_num$</span> (<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>, <span style="color: #228b22;">int32_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">num</span>)
{
  <span style="color: #a020f0;">return</span> trexio_read_$group_num$_32(file, num);
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_write_$group_num$</span> (<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int32_t</span> <span style="color: #a0522d;">num</span>)
{
  <span style="color: #a020f0;">return</span> trexio_write_$group_num$_32(file, num);
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_has_$group_num$</span> (<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>)
{

  <span style="color: #a020f0;">if</span> (file == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;

  assert(file-&gt;back_end &lt; TREXIO_INVALID_BACK_END);

  <span style="color: #a020f0;">switch</span> (file-&gt;back_end) {

  <span style="color: #a020f0;">case</span> TREXIO_TEXT:
    <span style="color: #a020f0;">return</span> trexio_text_has_$group_num$(file);
    <span style="color: #a020f0;">break</span>;

  <span style="color: #a020f0;">case</span> TREXIO_HDF5:
    <span style="color: #a020f0;">return</span> trexio_hdf5_has_$group_num$(file);
    <span style="color: #a020f0;">break</span>;
/*
<span style="color: #b22222;">  case TREXIO_JSON:</span>
<span style="color: #b22222;">    return trexio_json_has_$group_num$(file);</span>
<span style="color: #b22222;">    break;</span>
*/
  }
  <span style="color: #a020f0;">return</span> TREXIO_FAILURE;

}
</pre>
</div>
</div>
</div>
