src/templates_front/templator_front.org
*** Fortran templates for front end

    The ~Fortran~ templates that provide an access to the ~C~ API calls from Fortran.
    These templates are based on the use of ~iso_c_binding~. Pointers have to be passed by value.

     #+begin_src f90 :tangle write_num_64_front_fortran.f90
interface
   integer function trexio_write_$group_num$_64 (trex_file, num) bind(C)
     use, intrinsic :: iso_c_binding
     integer(8), intent(in), value :: trex_file
     integer(8), intent(in), value :: num
   end function trexio_write_$group_num$_64
end interface
     #+end_src

     #+begin_src f90 :tangle read_num_64_front_fortran.f90
interface
   integer function trexio_read_$group_num$_64 (trex_file, num) bind(C)
     use, intrinsic :: iso_c_binding
     integer(8), intent(in), value :: trex_file
     integer(8), intent(out) :: num
   end function trexio_read_$group_num$_64
end interface
     #+end_src

     #+begin_src f90 :tangle write_num_32_front_fortran.f90
interface
   integer function trexio_write_$group_num$_32 (trex_file, num) bind(C)
     use, intrinsic :: iso_c_binding
     integer(8), intent(in), value :: trex_file
     integer(4), intent(in), value :: num
   end function trexio_write_$group_num$_32
end interface
     #+end_src

     #+begin_src f90 :tangle read_num_32_front_fortran.f90
interface
   integer function trexio_read_$group_num$_32 (trex_file, num) bind(C)
     use, intrinsic :: iso_c_binding
     integer(8), intent(in), value :: trex_file
     integer(4), intent(out) :: num
   end function trexio_read_$group_num$_32
end interface
     #+end_src

     #+begin_src f90 :tangle write_num_def_front_fortran.f90
interface
   integer function trexio_write_$group_num$ (trex_file, num) bind(C)
     use, intrinsic :: iso_c_binding
     integer(8), intent(in), value :: trex_file
     integer(4), intent(in), value :: num
   end function trexio_write_$group_num$
end interface
     #+end_src

     #+begin_src f90 :tangle read_num_def_front_fortran.f90
interface
   integer function trexio_read_$group_num$ (trex_file, num) bind(C)
     use, intrinsic :: iso_c_binding
     integer(8), intent(in), value :: trex_file
     integer(4), intent(out) :: num
   end function trexio_read_$group_num$
end interface
     #+end_src

     #+begin_src f90 :tangle has_num_front_fortran.f90
interface
   integer function trexio_has_$group_num$ (trex_file) bind(C)
     use, intrinsic :: iso_c_binding
     integer(8), intent(in), value :: trex_file
   end function trexio_has_$group_num$
end interface
     #+end_src

** Templates for front end has/read/write a dataset

   This section concerns API calls related to datasets.

   | Function name                  | Description                         | Precision |
   |--------------------------------+-------------------------------------+-----------|
   | ~trexio_has_$group_dset$~      | Check if a dataset exists in a file | ---       |
   | ~trexio_read_$group_dset$~     | Read  a dataset                     | Double    |
   | ~trexio_write_$group_dset$~    | Write a dataset                     | Double    |
   | ~trexio_read_$group_dset$_32~  | Read  a dataset                     | Single    |
   | ~trexio_write_$group_dset$_32~ | Write a dataset                     | Single    |
   | ~trexio_read_$group_dset$_64~  | Read  a dataset                     | Double    |
   | ~trexio_write_$group_dset$_64~ | Write a dataset                     | Double    |

