templator_front.html

<div id="outline-container-org54ac865" class="outline-4">
<h4 id="org54ac865"><span class="section-number-4">3.2.1</span> C templates for front end</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
The C templates that correspond to each of the abovementioned functions can be found below.
First parameter is the <code>TREXIO</code> file handle. Second parameter is the variable to be written/read
to/from the <code>TREXIO</code> file (except for <code>trexio_has_</code> functions).
Suffixes <code>_32</code> and <code>_64</code> correspond to API calls dealing with single and double precision, respectively.
The basic (non-suffixed) API call on datasets deals with double precision (see Table above).
</p>


<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_read_$group_dset$_64</span> (<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>, $group_dset_dtype_double$* <span style="color: #a020f0;">const</span> $group_dset$)
{

  <span style="color: #a020f0;">if</span> (file  == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;
  <span style="color: #a020f0;">if</span> ($group_dset$ == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_2;

  <span style="color: #228b22;">trexio_exit_code</span> <span style="color: #a0522d;">rc</span>;
  int64_t $group_dset_dim$ = 0;

  /* <span style="color: #b22222;">Error handling for this call is added by the generator </span>*/
  rc = trexio_read_$group_dset_dim$_64(file, &amp;($group_dset_dim$));

  <span style="color: #a020f0;">if</span> ($group_dset_dim$ == 0L) <span style="color: #a020f0;">return</span> TREXIO_INVALID_NUM;

  <span style="color: #228b22;">uint32_t</span> <span style="color: #a0522d;">rank</span> = $group_dset_rank$;
  <span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">dims</span>[$group_dset_rank$] = {$group_dset_dim_list$};

  assert(file-&gt;back_end &lt; TREXIO_INVALID_BACK_END);

  <span style="color: #a020f0;">switch</span> (file-&gt;back_end) {

  <span style="color: #a020f0;">case</span> TREXIO_TEXT:
    <span style="color: #a020f0;">return</span> trexio_text_read_$group_dset$(file, $group_dset$, rank, dims);
    <span style="color: #a020f0;">break</span>;

  <span style="color: #a020f0;">case</span> TREXIO_HDF5:
    <span style="color: #a020f0;">return</span> trexio_hdf5_read_$group_dset$(file, $group_dset$, rank, dims);
    <span style="color: #a020f0;">break</span>;
/*
<span style="color: #b22222;">  case TREXIO_JSON:</span>
<span style="color: #b22222;">    return trexio_json_read_$group_dset$(file, $group_dset$, rank, dims);</span>
<span style="color: #b22222;">    break;</span>
*/
  }
  <span style="color: #a020f0;">return</span> TREXIO_FAILURE;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_write_$group_dset$_64</span> (<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>, <span style="color: #a020f0;">const</span> $group_dset_dtype_double$* $group_dset$)
{

  <span style="color: #a020f0;">if</span> (file  == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;
  <span style="color: #a020f0;">if</span> ($group_dset$ == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_2;
  <span style="color: #a020f0;">if</span> (trexio_has_$group_dset$(file) == TREXIO_SUCCESS) <span style="color: #a020f0;">return</span> TREXIO_DSET_ALREADY_EXISTS;

  <span style="color: #228b22;">trexio_exit_code</span> <span style="color: #a0522d;">rc</span>;
  int64_t $group_dset_dim$ = 0;

  /* <span style="color: #b22222;">Error handling for this call is added by the generator </span>*/
  rc = trexio_read_$group_dset_dim$_64(file, &amp;($group_dset_dim$));

  <span style="color: #a020f0;">if</span> ($group_dset_dim$ == 0L) <span style="color: #a020f0;">return</span> TREXIO_INVALID_NUM;

  <span style="color: #228b22;">uint32_t</span> <span style="color: #a0522d;">rank</span> = $group_dset_rank$;
  <span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">dims</span>[$group_dset_rank$] = {$group_dset_dim_list$};

  assert(file-&gt;back_end &lt; TREXIO_INVALID_BACK_END);

  <span style="color: #a020f0;">switch</span> (file-&gt;back_end) {

  <span style="color: #a020f0;">case</span> TREXIO_TEXT:
    <span style="color: #a020f0;">return</span> trexio_text_write_$group_dset$(file, $group_dset$, rank, dims);
    <span style="color: #a020f0;">break</span>;

  <span style="color: #a020f0;">case</span> TREXIO_HDF5:
    <span style="color: #a020f0;">return</span> trexio_hdf5_write_$group_dset$(file, $group_dset$, rank, dims);
    <span style="color: #a020f0;">break</span>;
/*
<span style="color: #b22222;">  case TREXIO_JSON:</span>
<span style="color: #b22222;">    return trexio_json_write_$group_dset$(file, $group_dset$, rank, dims);</span>
<span style="color: #b22222;">    break;</span>
*/
  }
  <span style="color: #a020f0;">return</span> TREXIO_FAILURE;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_read_$group_dset$_32</span> (<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>, $group_dset_dtype_single$* <span style="color: #a020f0;">const</span> $group_dset$)
{

  <span style="color: #a020f0;">if</span> (file  == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;
  <span style="color: #a020f0;">if</span> ($group_dset$ == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_2;

  <span style="color: #228b22;">trexio_exit_code</span> <span style="color: #a0522d;">rc</span>;
  int64_t $group_dset_dim$ = 0;

  /* <span style="color: #b22222;">Error handling for this call is added by the generator </span>*/
  rc = trexio_read_$group_dset_dim$_64(file, &amp;($group_dset_dim$));

  <span style="color: #a020f0;">if</span> ($group_dset_dim$ == 0L) <span style="color: #a020f0;">return</span> TREXIO_INVALID_NUM;

  <span style="color: #228b22;">uint32_t</span> <span style="color: #a0522d;">rank</span> = $group_dset_rank$;
  <span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">dims</span>[$group_dset_rank$] = {$group_dset_dim_list$};

  <span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">dim_size</span> = 1;
  <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">unsigned</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span>=0; i&lt;rank; ++i){
    dim_size *= dims[i];
  }

  $group_dset_dtype_double$* $group_dset$_64 = CALLOC(dim_size, $group_dset_dtype_double$);
  <span style="color: #a020f0;">if</span> ($group_dset$_64 == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_ALLOCATION_FAILED;

  assert(file-&gt;back_end &lt; TREXIO_INVALID_BACK_END);

  rc = TREXIO_FAILURE;

  <span style="color: #a020f0;">switch</span> (file-&gt;back_end) {

  <span style="color: #a020f0;">case</span> TREXIO_TEXT:
    rc = trexio_text_read_$group_dset$(file, $group_dset$_64, rank, dims);
    <span style="color: #a020f0;">break</span>;

  <span style="color: #a020f0;">case</span> TREXIO_HDF5:
    rc = trexio_hdf5_read_$group_dset$(file, $group_dset$_64, rank, dims);
    <span style="color: #a020f0;">break</span>;
/*
<span style="color: #b22222;">  case TREXIO_JSON:</span>
<span style="color: #b22222;">    rc = trexio_json_read_$group_dset$(file, $group_dset$_64, rank, dims);</span>
<span style="color: #b22222;">    break;</span>
*/
  }

  <span style="color: #a020f0;">if</span> (rc != TREXIO_SUCCESS){
    FREE($group_dset$_64);
    <span style="color: #a020f0;">return</span> rc;
  }

  <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">i</span>=0; i&lt;dim_size; ++i){
    $group_dset$[i] = ($group_dset_dtype_single$) $group_dset$_64[i];
  }

  FREE($group_dset$_64);
  <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_write_$group_dset$_32</span> (<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>, <span style="color: #a020f0;">const</span> $group_dset_dtype_single$* $group_dset$)
{

  <span style="color: #a020f0;">if</span> (file  == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;
  <span style="color: #a020f0;">if</span> ($group_dset$ == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_2;
  <span style="color: #a020f0;">if</span> (trexio_has_$group_dset$(file) == TREXIO_SUCCESS) <span style="color: #a020f0;">return</span> TREXIO_DSET_ALREADY_EXISTS;

  <span style="color: #228b22;">trexio_exit_code</span> <span style="color: #a0522d;">rc</span>;
  int64_t $group_dset_dim$ = 0;

  /* <span style="color: #b22222;">Error handling for this call is added by the generator </span>*/
  rc = trexio_read_$group_dset_dim$_64(file, &amp;($group_dset_dim$));

  <span style="color: #a020f0;">if</span> ($group_dset_dim$ == 0L) <span style="color: #a020f0;">return</span> TREXIO_INVALID_NUM;

  <span style="color: #228b22;">uint32_t</span> <span style="color: #a0522d;">rank</span> = $group_dset_rank$;
  <span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">dims</span>[$group_dset_rank$] = {$group_dset_dim_list$};

  <span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">dim_size</span> = 1;
  <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">unsigned</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span>=0; i&lt;rank; ++i){
    dim_size *= dims[i];
  }

  $group_dset_dtype_double$* $group_dset$_64 = CALLOC(dim_size, $group_dset_dtype_double$);
  <span style="color: #a020f0;">if</span> ($group_dset$_64 == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_ALLOCATION_FAILED;

  /* <span style="color: #b22222;">A type conversion from single precision to double reqired since back end only accepts 64-bit data </span>*/
  <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">i</span>=0; i&lt;dim_size; ++i){
    $group_dset$_64[i] = ($group_dset_dtype_double$) $group_dset$[i];
  }

  assert(file-&gt;back_end &lt; TREXIO_INVALID_BACK_END);

  rc = TREXIO_FAILURE;
  <span style="color: #a020f0;">switch</span> (file-&gt;back_end) {

  <span style="color: #a020f0;">case</span> TREXIO_TEXT:
    rc = trexio_text_write_$group_dset$(file, $group_dset$_64, rank, dims);
    <span style="color: #a020f0;">break</span>;

  <span style="color: #a020f0;">case</span> TREXIO_HDF5:
    rc = trexio_hdf5_write_$group_dset$(file, $group_dset$_64, rank, dims);
    <span style="color: #a020f0;">break</span>;
/*
<span style="color: #b22222;">  case TREXIO_JSON:</span>
<span style="color: #b22222;">    rc = trexio_json_write_$group_dset$(file, $group_dset$_64, rank, dims);</span>
<span style="color: #b22222;">    break;</span>
*/
  }

  FREE($group_dset$_64);

  <span style="color: #a020f0;">if</span> (rc != TREXIO_SUCCESS) <span style="color: #a020f0;">return</span> rc;

  <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_read_$group_dset$</span> (<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>, $group_dset_dtype_default$* <span style="color: #a020f0;">const</span> $group_dset$)
{
  <span style="color: #a020f0;">return</span> trexio_read_$group_dset$_$default_prec$(file, $group_dset$);
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_write_$group_dset$</span> (<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>, <span style="color: #a020f0;">const</span> $group_dset_dtype_default$* $group_dset$)
{
  <span style="color: #a020f0;">return</span> trexio_write_$group_dset$_$default_prec$(file, $group_dset$);
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_has_$group_dset$</span> (<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>)
{

  <span style="color: #a020f0;">if</span> (file  == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;

  assert(file-&gt;back_end &lt; TREXIO_INVALID_BACK_END);

  <span style="color: #a020f0;">switch</span> (file-&gt;back_end) {

  <span style="color: #a020f0;">case</span> TREXIO_TEXT:
    <span style="color: #a020f0;">return</span> trexio_text_has_$group_dset$(file);
    <span style="color: #a020f0;">break</span>;

  <span style="color: #a020f0;">case</span> TREXIO_HDF5:
    <span style="color: #a020f0;">return</span> trexio_hdf5_has_$group_dset$(file);
    <span style="color: #a020f0;">break</span>;
/*
<span style="color: #b22222;">  case TREXIO_JSON:</span>
<span style="color: #b22222;">    return trexio_json_has_$group_dset$(file);</span>
<span style="color: #b22222;">    break;</span>
*/
  }
  <span style="color: #a020f0;">return</span> TREXIO_FAILURE;
}
</pre>
</div>
</div>
</div>
