templator_front.html

<div id="outline-container-org1753b9e" class="outline-3">
<h3 id="org1753b9e"><span class="section-number-3">3.3</span> Sparse data structures</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Sparse data structures are used typically for large tensors such as
two-electron integrals. For example, in the <code>trex.json</code> file sparse
arrays appear as for the <code>eri</code> :
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #8b2252;">"ao_2e_int"</span>  : {
  <span style="color: #8b2252;">"eri_num"</span>  : [ <span style="color: #8b2252;">"int"</span>, [  ] ]
  <span style="color: #8b2252;">"eri"</span>      : [ <span style="color: #8b2252;">"float sparse"</span>, [ <span style="color: #8b2252;">"ao.num"</span>, <span style="color: #8b2252;">"ao.num"</span>, <span style="color: #8b2252;">"ao.num"</span>, <span style="color: #8b2252;">"ao.num"</span> ] ]
}
</pre>
</div>

<p>
The electron repulsion integral \(\langle ij | kl \rangle\) is 
represented as a quartet of integers \((i,j,k,l)\) and a floating
point value.
</p>

<p>
To store \(N\) integrals in the file, we store
</p>

<ul class="org-ul">
<li>An array of quartets of integers</li>
<li>An array of values (floats)</li>
</ul>

<p>
Both arrays have the same size, \(N\), the number of non-zero integrals.
Knowing the maximum dimensions allows to check that the integers are
in a valid range, and also lets the library choose the smallest
integer representation to compress the storage.
</p>

<p>
Fortran uses 1-based array indexing, while C uses 0-based indexing.
Internally, we use a 0-based representation but the Fortran binding
does the appropriate conversion when reading or writing.
</p>

<p>
As the number of integrals to store can be prohibitively large, we 
provide the possibility to read/write the integrals in chunks. So the
functions take two extra parameters:
</p>
<ul class="org-ul">
<li><code>offset</code> : the index of the 1st integral we want to read. An
offset of zero implies to read the first integral.</li>
<li><code>num</code> : the number of integrals to read.</li>
</ul>

<p>
We provide a function to read a chunk of indices, and a function to
read a chunk of values, because some users might want to read only
the values of the integrals, or only the indices.
</p>

<p>
Here is an example for the indices:
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_read_chunk_ao_2e_int_eri_index_32</span>(<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>,
                                         <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">offset</span>,
                                         <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">num</span>,
                                         <span style="color: #228b22;">int32_t</span>* <span style="color: #a0522d;">buffer</span>)
{
  <span style="color: #a020f0;">if</span> (file  == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;
  <span style="color: #a020f0;">if</span> (offset   &lt; 0L) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_2;
  <span style="color: #a020f0;">if</span> (num      &lt; 0L) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_3;

  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">uint32_t</span> <span style="color: #a0522d;">rank</span> = 4;  // <span style="color: #b22222;">To be set by generator : number of indices</span>

  <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">nmax</span>;             // <span style="color: #b22222;">Max number of integrals</span>
  <span style="color: #228b22;">trexio_exit_code</span> <span style="color: #a0522d;">rc</span>;

  rc = trexio_read_ao_2e_int_eri_num(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">file</span>, &amp;nmax);
  <span style="color: #a020f0;">if</span> (rc != TREXIO_SUCCESS) <span style="color: #a020f0;">return</span> rc;

  <span style="color: #a020f0;">switch</span> (file-&gt;back_end) {

  <span style="color: #a020f0;">case</span> TREXIO_TEXT:
    <span style="color: #a020f0;">return</span> trexio_text_read_chunk_ao_2e_int_eri_index(file, buffer, offset, num, rank, nmax);
    <span style="color: #a020f0;">break</span>;

  <span style="color: #a020f0;">case</span> TREXIO_HDF5:
    <span style="color: #a020f0;">return</span> trexio_hdf5_read_chunk_ao_2e_int_eri_index(file, buffer, offset, num, rank, nmax);
    <span style="color: #a020f0;">break</span>;

  <span style="color: #a020f0;">default</span>:
    <span style="color: #a020f0;">return</span> TREXIO_FAILURE;  /* <span style="color: #b22222;">Impossible case </span>*/
  }
}
</pre>
</div>

<p>
For the values, 
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_read_chunk_ao_2e_int_eri_value_64</span>(<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>,
                                         <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">offset</span>,
                                         <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">num</span>,
                                         <span style="color: #228b22;">double</span>* <span style="color: #a0522d;">buffer</span>)
{
  <span style="color: #a020f0;">if</span> (file  == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;
  <span style="color: #a020f0;">if</span> (offset   &lt; 0L) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_2;
  <span style="color: #a020f0;">if</span> (num      &lt; 0L) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_3;

  <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">nmax</span>;             // <span style="color: #b22222;">Max number of integrals</span>
  <span style="color: #228b22;">trexio_exit_code</span> <span style="color: #a0522d;">rc</span>;

  rc = trexio_read_ao_2e_int_eri_num(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">file</span>, &amp;nmax);
  <span style="color: #a020f0;">if</span> (rc != TREXIO_SUCCESS) <span style="color: #a020f0;">return</span> rc;

  <span style="color: #a020f0;">switch</span> (file-&gt;back_end) {

  <span style="color: #a020f0;">case</span> TREXIO_TEXT:
    <span style="color: #a020f0;">return</span> trexio_text_read_chunk_ao_2e_int_eri_value(file, buffer, offset, num, nmax);
    <span style="color: #a020f0;">break</span>;

  <span style="color: #a020f0;">case</span> TREXIO_HDF5:
    <span style="color: #a020f0;">return</span> trexio_hdf5_read_chunk_ao_2e_int_eri_index(file, buffer, offset, num, nmax);
    <span style="color: #a020f0;">break</span>;

  <span style="color: #a020f0;">default</span>:
    <span style="color: #a020f0;">return</span> TREXIO_FAILURE;  /* <span style="color: #b22222;">Impossible case </span>*/
  }
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org060103a" class="outline-2">
<h2 id="org060103a"><span class="section-number-2">4</span> Fortran helper/wrapper functions</h2>
<div class="outline-text-2" id="text-4">
<p>
The function below adapts the original C-based <code>trexio_open</code> for Fortran.
This is needed due to the fact that strings in C are terminated by <code>NULL</code> character <code>\0</code>
unlike strings in Fortran.
Note, that Fortran interface calls the main <code>TREXIO</code> API, which is written in C.
</p>

<div class="org-src-container">
<pre class="src src-f90"><span style="color: #a020f0;">contains</span>
   <span style="color: #228b22;">integer</span>(8) <span style="color: #a020f0;">function</span> <span style="color: #0000ff;">trexio_open</span> (filename, mode, backend)
     <span style="color: #a020f0;">use</span>, <span style="color: #a020f0;">intrinsic</span> :: <span style="color: #0000ff;">iso_c_binding</span>
     <span style="color: #a020f0;">implicit</span> <span style="color: #228b22;">none</span>
     <span style="color: #228b22;">character</span>(len=*)      ::<span style="color: #a0522d;"> filename</span>
     <span style="color: #228b22;">character</span>, <span style="color: #a020f0;">intent</span>(in), <span style="color: #a020f0;">value</span> ::<span style="color: #a0522d;"> mode</span>
     <span style="color: #228b22;">integer</span>, <span style="color: #a020f0;">intent</span>(in), <span style="color: #a020f0;">value</span>   ::<span style="color: #a0522d;"> backend</span>
     <span style="color: #228b22;">character</span>(len=<span style="color: #a020f0;">len_trim</span>(filename)+1) ::<span style="color: #a0522d;"> filename_c</span>

     filename_c = <span style="color: #a020f0;">trim</span>(filename) // <span style="color: #008b8b;">c_null_char</span>
     trexio_open = trexio_open_c(filename_c, mode, backend)
   <span style="color: #a020f0;">end function</span> <span style="color: #0000ff;">trexio_open</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: TREX-CoE</p>
<p class="date">Created: 2021-06-04 Fri 12:15</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
